{
  "0": "What about the blue comments (The doc comments). We can use them, too, right?  Or are they not really supposed to be used in this way? (The doc comments start with `/**` and end with `*/`.)",
  "1": "So comments are basically like Pseudo-Code in the previous video?\nThis kinda confuses me.",
  "2": "I have done javaScript in codecademy.com and in Khan Academy. And I realized that these two javaScripts are different(!?). Could anyone tell me why are they different?",
  "3": "How do you do a star?",
  "4": "Can you do other colors on comments than just blue and green? \nhow about orange",
  "5": "Why when I put the words, \"`TODO`\" into a blue comment (`/** TODO **/`), the words (TODO) turn into a green color? Does it signify anything? Is it a glitch? Another Khan Academy function I don't know about?\nThanks!",
  "6": "So the comments are just a way of explaining things to other programmers and don't modify the code itself?",
  "7": "What does parbola mean?",
  "8": "can you trick out comments to be any color?",
  "9": "how in the world did all those comments appear after Pamela highlighted it?",
  "10": "You talked all about green comments. What are blue comments for?",
  "11": "what is the difference between:\n/*\n*/\nand\n/**\n**/\n?",
  "12": "is better to put a comment like this\n(coding) //(comment)//\nor\n //(comment)//\n(coding)",
  "13": "what is the difference between using 2 stars like: ```/**hi**/  ```and 1 star like: ```/* hi*/ ```?",
  "14": "I've browsed other programs on Khan Academy and seen some really advanced ones. I did notice that some people have little bars, or buttons, within their code that essentially hide their code to save space. What is that trick called and how do they do that?",
  "15": "// Calculate y according to the path of a parabola with respect to \"t\":\n    // y = (velocity)*t - (acceleration)*t^2;\n    // We can tweak the velocity and acceleration constants for our fake world\n    y = -0.02*t*t+ 3.5*t;\nIn this  formula of y if I use -0.02t instead of t the ball never comes back and if I use t^2 the ball bounces faster than t*t but t*t = t^2. Also, if I use only t^ the ball still bounces. can anyone explain why?",
  "16": "Why this bouncing ball never touches the ground (it's never connects to it's shadow)?",
  "17": "I was reading some code made by a friend of mine who wrote his own CMS program for the websites he runs, and I noticed he didn't use any comments. I asked him why, and he said to save bandwidth on his sites. Every line you type, including comments, has to be loaded if you make something available online. \n\nWhat would you say about that concept?",
  "18": "Sometimes, when I make a program, I usually make the variables so that I can understand the code. For example, if I were creating a variable for a color, I would probably use the variable color1, color2, etc... I like using comments too though, but in your opinion, which is better? Thank You! : )",
  "19": "How do you make the multi line comment blue??",
  "20": "Would you say that your code could have _too many_ comments?",
  "21": "Can you comment using one / instead of //?",
  "22": "What does the \"Spin Off\" thing mean? Pretty green at this at the moment.",
  "23": "Why was pseudo-code explained at the end of \"Intro to JS: Drawings & Animation\"? Wouldn't it have been a little more logical to explain it since it was used so early ?\n\nBtw, that ball bouncing program is very hypnotic.",
  "24": "How long will it take you to be comfortable to code where I can just code things from my head. How do you know before hand that y = (velocity)*t - (acceleration)*t^2;\n    // We can tweak the velocity and acceleration constants for our fake world\n    y = -0.02*t*t + 5.0*t;",
  "25": "Why two slashes when I can make a comment with one slash?",
  "26": "Why do we need comments?You can't see the comments and the lines of code in a video game or program anyways.",
  "27": "I do'nt really get it",
  "28": "Why are `/*` (green) comments and  ` /**`  (blue) comments different colors? Are they supposed to be used for different things?",
  "29": "Love your videos! I prefer them to all other teachers. Don't tell them :D",
  "30": "What would happen if you wrote /// would that no longer be a comment?\n-Lestrade",
  "31": "So, what's the difference between Psuedo-code and comments? I don't understand.\nAnd, does // represent Psuedo-code or a comment?",
  "32": "What's the arc of a parabola?",
  "33": "Should I use comments or pseudo code?",
  "34": "Can someone please tell me what do the % operators do? with an example if it's hard to explain. I really appreciate it, thanks.",
  "35": "Aside from the color and syntax, how does a blue multi-line comment differ from a green one in terms of usage?",
  "36": "its annoying how i watch the video and it doesnt show i watch it even after i refresh T_T",
  "37": "@pamela, could you maybe put this video closer to the beginning of this intro to animation? Because I think I saw you use multi-line comments before this video, when you said to comment out lines for reference when creating loops. If you put it to the beginning, you could teach everyone this a lot sooner, which could make programming a heck lot easier.",
  "38": "In the comment explaining the code \" // y = (velocity)*t - (acceleration)*t^2;\" what does the \"^\" operator do?",
  "39": "if i put a game that has a 600 by 600 canvas on a web sight will it show up 600 by 600?",
  "40": "I have looked for other people's programs but cannot find how to browse them any advice?",
  "41": "What would the equation be to make the shadow go smaller as the ball went up?",
  "42": "What's a parabola?",
  "43": "is this javascript or javaquery?",
  "44": "i dont understand how the coordinates work.",
  "45": "at this point should we be able to write this program from scratch? im finding it hard to get my head around.",
  "46": "how to type a comment",
  "47": "How do u use /n? Im trying to do\n\nText(\"Hi/n turtles r cool/n fre sha voc a do\", 30, 50);\n\nIt doesnt work, it just shows on the canvas\n\nHi/n turtles r cool/n fre sha voc a do\n\nHow do i make it so it makes a break? I want to make it say - \n\nHi\nTurtles r cool\nFre sha voc a do",
  "48": "How do you draw on the program when your doing the video?",
  "49": "What is the use of the multi line comments? Why can't we just use the comments that you put // for? What is the difference?",
  "50": "I wish you guys could share it with only some people so they could help you at the same time. Could you guys do that please?",
  "51": "I am still very confused. How do you make sure that you are filling color in the spot you want it in?",
  "52": "What is the difference between` /** comment **/` and \n```/*co\nmment \n*/```",
  "53": "I'm still confused about using a 'var' function.\non the video, she wrote 'var y = 0;' , and at the end of the code, she wrote 'var correctedY = 250-y;'\nis that mean 'var correctedY=250-0;' ??",
  "54": "This is a good learning program hope people make more learning programs  :)",
  "55": "I'm rather annoyed because in my program, every time i edit code or even add a comment the project restarts. WHY? IS this just happening to me or are all programs like this?\nP.S. This is my first program",
  "56": "Why does the Oh Noes guy show up?",
  "57": "Could someone explain to me the equation being used in the bouncing ball app?\n It says y = (velocity)*t - (acceleration)*t^2;\nWell this is the 'distance' in constant motion minus the distance in accelerated motion, right?\ns = v * t\ns = a * t ^ 2 / 2 (the last '/2' part is missing in Pamela's equation)\nWhy did substracting those two gave such an effect?",
  "58": "Ok, this isn't particularly relevant to this topic, but I don't know where else to look.\nI'm learning to make a game using processing.js, and I've got some code written out, and want to test it.\nHowever, I can't find anywhere that tells me HOW to save this code so I CAN test it, any time I attempt to run it (using Notepad++, also have Sublime Text 2 but haven't actually bought it yet (doing that soon as I can)) it simply opens a browser and displays my code. \nHow, and where if that's important, do I save this file so I can actually use it??\nIs there some kind of line of code I need to run it, or am I able to start with just \nfinal int screenWidth = 400;\nfinal int screenHeight = 400;\nvoid initialize () {\n\taddScreen (\"mylevel\", new MyLevel (screenWidth, screenHeight));\n}\nlike was shown?",
  "59": "Won't velocity and acceleration both be 0 since t = 0 and anything multiplied by 0 is 0?",
  "60": "Whats a parabola?",
  "61": "At 2:54, how do you high light the code to reveal the comments? And can I only you use comments if someone write comments in the code or, could I use comments to try to understand someone else's code that has no comments?",
  "62": "how do we get the coeds right",
  "63": "Well, I've been thinking about something i've thought of for a long time. HOW does the computer know what to do? For example, if I were to type ```ellipse(50, 50, 200, 200)```, how would it know to draw an ellipse 50x50 pixels wide/long and its center at 200, 200 instead of drawing a rectangle that's 25x98 and it center at 59, 293 (assume that ```rectmode(CENTER)``` was active)?",
  "64": "Can someone explain var y = 0; at the start versus y = -0.02*t*t + 3.8*t;. I understand one is global and one is local but why doesnt moving var t inside the function work? thanks",
  "65": "Why is the shadow of the ball getting bigger when the ball is going farther so the shadow should get smaller, right??",
  "66": "How does she know I'm a human?",
  "67": "At 0:34, did you receive any negative answer to that question? :)",
  "68": "Why didn't the first lessons have info about comments.  Rather than put them at the end like you did.  Likewise for Pseudo-Code.",
  "69": "What is the difference between\n```\n/***Whee**/\n```\nand\n```\n/**Whee**/\n```\nIn other words, what is the difference with a green multi-line comment and a blue multi-line comment?",
  "70": "Is it my imagination or does the ball bounce up above groung much of the time?",
  "71": "Why Don't KHAN Add [console.log('');] ?",
  "72": "0:17 How do you randomly scribble onto your canvas? There's not even any code for that on your visible program!",
  "73": "Why is the audio so static? Are you experiencing it to?",
  "74": "What is a regular expression?  What is it used for?\n(starts with \"/\")",
  "75": "How did you make the ball go slower towards the top?",
  "76": "Am I supposed to already know the calculating based on velocity right now",
  "77": "I didn't understand how did you create  comment ? I mean you just clicked  and all comments appeared , How? What did click or you  just copyed  and pasted ?",
  "78": "is the shadow related to the balls position or is it separate",
  "79": "Where is the origonal bouncing ball program?",
  "80": "How to animate rain drops like ball again and again? I tried lot but meaningless kindly guide me?",
  "81": "Did you make the bouncing penguin yet?",
  "82": "I can't spin-off! Help me!",
  "83": "What is the difference between /** and /* ?",
  "84": "At 0:34, in the interactive transcript, it is supposed to say \"like you and me?\" with a question mark, or should that be a period?",
  "85": "re: comments for web page - is there a security issue, if you designed something with code, wit others be able to copy that?",
  "86": "So there's no difference between '//' and '/* and *\\'?",
  "87": "Can you make it simpler \nfor if children were going to watch this video?",
  "88": "What do the different colors of text in code signify? (Like blue, green, black, and possibly other stuff.)",
  "89": "\"You are a human, right?\"\nNope, I'm a fennekin.\nNot a human.",
  "90": "Would this mean that we should comment over the other codes we did?",
  "91": "Where is this \"bouncing ball program\" from?",
  "92": "So comments are basically like Pseudo-Code in the previous video right?\nThis confuses me a lot.",
  "93": "How can we get images other than the ones Khan academy provides? - Thanks from ET",
  "94": "what about the blue comments can we use them, right?",
  "95": "pamela, are you still programming, or are you just relaxing in your house? Because you could be making more programs.",
  "96": "Not so important, but; shouldn't the shadow increase when y is lower, and decrease when y is greater? What I see in that program is just the opposite. In fact, the comment for the shadowSize function says \"We grow the shadow bigger as we increase y\".\nI mean, try throwing a ball in the real world: The higher it gets, the smaller the shadow becomes.",
  "97": "How do you do that bouncy ball thing?",
  "98": "Do other JavaScript compilers display the program of the code you are writing next to it? I like how Khan Academy does that so I'm curious if it is the same for other IDEs.",
  "99": "how do you make the words on there?",
  "100": "Is it still a vector if we say \"The brick moved 5m towards Sal\" even if 'towards Sal' has no specified location.",
  "101": "Does vectors have a location in space? does it vary with time?\r\nThis is a question from my Physics textbook. I even couldn't understand the question. Can you explain and answer me?\r\n",
  "102": "I'm still sort of foggy on the difference between velocity and speed... I get velocity being a vector quantity and speed being a scalar quantity...but, what's the general difference between them?",
  "103": "what is meant by magnitude?",
  "104": "What is the triangle symbol at 4:30?",
  "105": "I understand that velocity is speed with direction. But how does something with speed not have direction?",
  "106": "A scalar value cannot be a vector because it does no include direction, but can vectors be considered scalar?",
  "107": "Is time a vector or a scalar? I mean time does have a direction, doesn't it?(future)",
  "108": "How does this definition of a vector from physics relate to vectors as I know them from the linear algebra playlist?",
  "109": "What is the difference between distance and displacement?",
  "110": "Can a vector have zero component along a line and still have non zero magnitude?",
  "111": "If people developed the ability to time-travel, would time be a vector or a scalar quantity?",
  "112": "how is force a vector quantity?",
  "113": "O.K. so on earth we can say that an object is going with velocity v(direction North To South). But what I have learned now is that every point in the universe is the centre of universe.\nso question 1 \nIs this true?\nquestion 2\nif yes than how will you define direction of a particle. I mean  that everywhere you are going in the universe you are at the centre of it.",
  "114": "How did Sal decide that the time goes on the bottom of a fraction ? Why not seconds per meter ?",
  "115": "I got the vectors and scalars but everything else... my mind is running circles",
  "116": "What is the name for a quantity with only direction?",
  "117": "Is displacement the same as velocity?(I am a bit confused)",
  "118": "why is work a scalar quantity? \nwork=force x distance and\nforce=mass x acceleration \nso.. I'm not getting the point",
  "119": "If time has a direction and speed is distance divided by time, then doesn't speed also have a direction?",
  "120": "When stating the velocity of something, do we have to say \"to the right/left\" or \"going up/down\" or does a positive and negative sign mean the same? If it does... Does positive mean up/right and negative mean down/left?",
  "121": "What use do vectors have in physics? Why would direction be so important people need a separate thing with direction and one without?",
  "122": "is acceleration is a vector or scalar?",
  "123": "so in order to be a vector it has to have size and it has to move in a specific direction? and if it doesn't tell you the direction its a scalar?",
  "124": "Can you explain how to find velocity using a graph",
  "125": "How can time be both, a vector and a scalar quantity? Ideally it should be vector because, theoretically, it is possible have negative time. (By relativity.) Say we are dealing with tachyons. Now what?",
  "126": "Isn't a scalar the same exact thing as distance? And is a vector the same thing as a scalar, except the fact that it shows the direction?",
  "127": "I understand that vectors have magnitude and direction, and scalars have only magnitude, but are there quantities that have more than two elements - or something that has magnitude, direction, and something else? I've heard of tensors, but I don't know exactly what they are or if they fit my description.",
  "128": "Is time a scalar or a vector.And why?",
  "129": "is weight scalar or vectar quantity",
  "130": "what actually a velocity is? and how is it different from speed?",
  "131": "If acceleration is the rate of change in velocity, then what is the rate of change in speed?",
  "132": "what is the main difference between vectors & scalars?",
  "133": "Can time also a vector?  For example, one could say, \"20 minutes in the future\".  20 minutes would be the magnitude and \"in the FUTURE\" would be a direction (forward in time) since time is a dimension (or at least based upon current understanding...).  Or are vectors only applicable to spatial dimensions and not time dimensions?",
  "134": "Is direction a vector, scalar, or neither?",
  "135": "ok..... i kinda understand what u said Tomas but what Mason said makes a little more sense. I understand that math is a tool and physics is just using it but what i dont get is why?......... Back to Tomas why does science rely on math instead of its own logic? I feel dumb:(",
  "136": "Is work a scalar? Does the SAT PHYSICS test consider work as a scalar or a vector?",
  "137": "what does odometer measures?",
  "138": "At 4:32, what does Sal mean by the triangle?",
  "139": "What if there is a given direction but not a given magnitude/size?",
  "140": "What is the difference between displacement and distance?",
  "141": "At 1:34 Sal asks if the brick example is a vector or scalar. He says it is a scalar because you only know it moved 5 meters, but when he draws it he shows the direction of the movement by the arrow, moving to the right. So it should really be a vector, right?",
  "142": "What is the specific definition of size in \"magnitude/size\"? Are they meant to be synonymous? A little confused. Thank you!",
  "143": "when you show time with out the direction would it not be a vector? you said that time moves in direction",
  "144": "what would you call something that has only a direction?\ne.g i moved the brick to the right.",
  "145": "So just confirming. Time is a vector and a scalar quantity but in the right contexts? Please correct me if I'm wrong.",
  "146": "Isn't Magnitude the same as size ?",
  "147": "Just to get it clear, a scalar isn't a velocity, but a vector is?",
  "148": "Let's say I throw the brick five meters to the right:\nIt's not going straight up, right, down; it's traveling along a parabola-shaped curve. This means that the degree of its motion relative to the ground is constantly changing, and its direction is constantly changing... So does that mean it has an infinite number of vectors?",
  "149": "Is time ever considered to be a direction?",
  "150": "should calculator be in radians or degrees?",
  "151": "What if your talking about acceleration of an object in relation to its movement and speed, what if your also talking about direction, what does that count as a vector , or a scalar?",
  "152": "what do you mean by Magnitude?",
  "153": "Why do us humans only feel acceleration and deceleration?",
  "154": "what is magnitude ? i didn't understand",
  "155": "Why would you need to divide the distance by the speed?",
  "156": "So should time be represented as a scalar or a vector?",
  "157": "Can Time be counted as a type of quantity ?",
  "158": "at 0:47, what does he mean by direction? does he mean it is moving in a direction or is it pointed in a direction that is gonna move towards?",
  "159": "If velocity is a vector quantity, shouldn't the direction also be mentioned with the magnitude (its speed)? People generally use the terms speed and velocity interchangeably, without the direction being indicated. Is this correct?",
  "160": "Is it right to say that a vector quantity is a physical quantity whose magnitude depends on direction?",
  "161": "In the video, 5 meters was the distance, but what would the magnitude/size be? Also, is velocity the same as speed?",
  "162": "So, if there is a body changing its velocity i mean variable velocity so how would we describe it.",
  "163": "Is Vector and Velocity, essentially the same thing, in that case?",
  "164": "is the earth's movement around the sun is a vector or a scalar",
  "165": "i know that \"2.5m/s\" is a scalar.\nBut if I stated \"Take rightward as positive and leftward as negative\" before calculation, would \"2.5m/s\" becomes a vector?",
  "166": "Why cant we call vectors velocity and scalars speed?",
  "167": "why do we differentiate between scalar and vector? what is the advantage of it?",
  "168": "what is the diffrence between speed and velocity",
  "169": "So u mean:\nVectors magnitude/size and DIRECTION\n\nScalars magnitude/size and DISTANCE\n\nam  I right?",
  "170": "do all scalars when given a direction have their vector from\nEg Distance(Scalar)  + Direction ---> Displacement(Vector)",
  "171": "6:40\nIs it not moving 5 meters in the direction of forward in time? Say I move said brick 5 meters to the left going back in time? (Basically 5 meters to the right forwards in time.) Saying 5 meters in x direction doesn't specify the direction of time.",
  "172": "What is a vector in math?",
  "173": "what does displacement mean??",
  "174": "as far as I have learn there\"s only 7 vector examples:\nDisplacement, velocity, acceleration, weight, force, Momentum, gravity\nMy question is are there anymore examples for vector?",
  "175": "So what is displacement, I do not really understand it that well?",
  "176": "why is this so hard?",
  "177": "Why is direction important?",
  "178": "Is energy a vector quantity",
  "179": "Is it just a coincidence that the sign for magnitude and the absolute value is same? Is it same because of both take the positive value of a number?",
  "180": "Is time a scalar or a vector quantity? Sal mentioned it is either a scalar or vector as it can only move in one direction.",
  "181": "Hij,\n\nwhy is m/s not both when time has a direction ?\nI understood the difference but I wondered if time it self has a direction. \nthanks for any answer.",
  "182": "Would displacement also count as distance since they aren't technically the same thing?",
  "183": "What did the 'DELTA' followed by an 'E' mean?",
  "184": "What is magnitude?What is the difference between magnitude and size?",
  "185": "From 5:13 to 5:28, when would time be considered negative, since simple physics does not introduce any such thing as negative time?",
  "186": "In the video, Sal says that time can be scalar and vector both. Why is this so? Can any other quantity can be like this?",
  "187": "Is Displacement different from Distance? For example, instead of saying the brick was displaced, could you say that in case of the vector the brick moved a distance of 5m to the right?",
  "188": "So, technically speaking, speed is just how fast something is moving while the velocity tells the speed and the direction it is moving as well, right?",
  "189": "Is velocity speed in a specified direction or is velocity much more different than that cause velocity is the measure of displacement over time while speed is the measure of distance over time and displacement and distance are in turn very different. Please, anyone clarify this concept for me.",
  "190": "Speed is an example of scalar and velocity for a vector can  you give any other examples",
  "191": "Distance + direction = displacement\nSpeed + direction = velocity\nWhat happens if you get Velocity + Displacement?",
  "192": "Why pressure is considered as a scalar quantity even though it has a direction. i.e. Pressure always acts in a downward direction?",
  "193": "is force and energy a scalar or vector quantity?",
  "194": "An athlete completes two rounds of a circular track and returns to the starting point.what is the distance covered by the athlete and his displacement",
  "195": "What's the diff between displacement and vector?",
  "196": "what is the difference between velocity and displacement?",
  "197": "Would saying \"I displaced the brick 5 meters to the right and then 4 meters to the left\" be a vector? Basically, can vectors have multiple directions?",
  "198": "what is a vector i just started physics as a junior at a christain school\nhow does a vector work or function",
  "199": "what is the difference between vectors and rays?",
  "200": "hello, i am a student from Indonesia. is it too late to learning about computer science when my age is already 20?",
  "201": "Hey!I got another question:If i started making a web page in HTML,can I continue working on it in CSS?Or will I have to start it all over again?Thank you!",
  "202": "how can you make a website and post it on the internet",
  "203": "Im in 8th grade, and im in webdesign...and i just did the write a poem challenge...and my web design teacher told me to write the code like this\n\n<body>\n<h1>...</h1>\n<p>...</p>\n<p>...</p>\n</body>\n(Just for the body)\nCould this also be correct?",
  "204": "What is the difference between a server and a client?",
  "205": "if you make a website how can u get .com for free?",
  "206": "Do HTML, CSS, and Java all work together to create a website? So would you have to know all 3 to create a website?",
  "207": "but how do you make web of your own",
  "208": "Why is the 3 code to code a website HTML, CSS, and JS, but there are over codes that can code a website like Python and C++? Is it just for the course being taught or is it more?",
  "209": "Will we be able to make websites or only webpages? I know you can use links to have a toolbar that brings you to other webpages but will we be able to do that without it being really slow or at all?",
  "210": "What tools do I need or recommend us to start writting html code? Thanks in advance.",
  "211": "I am 91 is it to late to learn?",
  "212": "What was the first webpage. Does anyone know the web address.",
  "213": "how do you make a website",
  "214": "Are java and javascript the same?",
  "215": "How do you animate something? (Not using .gifs)",
  "216": "Where can i find lectures for C++ programming? pls answer.",
  "217": "Is HTML and CSS the same thing as computer programming?",
  "218": "What is 'server' ?",
  "219": "What client/browser are you using? I'm using Google Chrome on a laptop.",
  "220": "How would someone in a different country, who speaks a different language, with different letters, go about programming a webpage?",
  "221": "how do you no its a safe website",
  "222": "Why do we use HTML?",
  "223": "How can I put a Processing JS file in a HTML file? Is there a way to link it?",
  "224": "Why are the different sources of electronics called clients instead of something else? Why not something else?",
  "225": "What is size ( width,  height).",
  "226": "Where do you start to program a website from scratch? Do you have to buy/download programming software for your computer or do you do it on a website?",
  "227": "What is the difference between Java and JavaScript?",
  "228": "What version of HTML is the tutorial using?",
  "229": "Is this html5? Thank you",
  "230": "How are HTML and JavaScript combined when building a website?",
  "231": "My favorite website is Kahnacademy ;) I'm using chrome too!",
  "232": "hello, i am a self employ  from India. is it too late to learning about computer science when my age is already 38?\nbut im learning \nit is help full my grow \nthanks to khan academy",
  "233": "I don't know if we're allowed to create HTML projects on Khanacademy. Are we?",
  "234": "how do you make a website",
  "235": "Okay, so I asked this question before elsewhere, but I didn't get a clear answer. So here I ask the question again:\n\n`Hello, I was wondering, is it possible to make games using html like how we do with PJS and with (or without) loading the Processing JS? And will it be as good as a game made by using PJS (e.g. can make big games without lagging to much)? `\nAnd I wonder how can I achieve that, if that is possible.",
  "236": "I watched the video but it says it is missing. Can someone tell me why and give me a solution",
  "237": "what's php? and what's the difference between it and html?",
  "238": "Should I take a different course like Intro to JS before I do this, or can I start with this now?",
  "239": "Do they still use HTML to make webpages?",
  "240": "What does JS mean exactly?",
  "241": "What's the difference between  <P style=\"color:GREEN\">hello</p>  and  <P><color=\"GREEN\">hello</color></p>  ?if i make any mistake,please forgive..",
  "242": "Will this teach you how to make webpages AND websites?",
  "243": "Hi, I am a 18 year old high school senior and am just now starting to become very intrested in computer programming but am having such a difficult time understanding and learning all of this. What I really want to know is where start because i have no knowledge on computer programing, I need to learn the very simple basics.",
  "244": "Are all the computing systems connected? (HTML, CSS, and JS)",
  "245": "I am very displeased. I was just writing a website and something happened. I didn't press any keys and all of a sudden my whole website was gone! I would really like it back. I used to love Khan, but now I think it could really use some help. I am very frustrated and would like my website back Now! I just can't believe it. I really thought that Khan was great, but it was a total waste of my day. If any one reads this comment, make sure to back up what you are doing! This is very time consuming and annoying. I will try to find a better website to practice programming on instead.  I am very sad. Is there any way to get that back? This is not the first time this has happened. Please fix this problem.",
  "246": "Whats the difference between the a website and a webpage?",
  "247": "hello, i am a student in  high school. I am going to be in 10th grade and i want to learn about computer science, but is it to late for this. especially i want to go to college",
  "248": "I have heard that JavaScript presents quite a few security issues and that there may be some movement away from JavaScript as a result. Even if this is the case JavaScript is a good language to get practice with. \n\nShould I be concerned about this, and are there other languages that serve similar purposes?",
  "249": "Lets say you make an awesome HTLM program on KA. How could you transfer it to the internet?",
  "250": "Is there any language other than HTML that is also used to design webpages ?\nFor example Javascript is common but there are many other scripting languages that may be used as alternatives.",
  "251": "im a 8th grader and i was thinking can i learn comp sci at age 14?",
  "252": "Why is this so complicated?",
  "253": "So how do programmers make HTML, CSS and JavaScript work together? On khan academy we can program a JavaScript program, or a HTML webpage but how would you combine those with CSS to make an actual standalone web page?",
  "254": "Who made this? It sounds like Vi-hart.",
  "255": "Isn't that thing where you do Ctrl-Shift-I?",
  "256": "This is intresting.",
  "257": "When making the website interactive, how do you incorporate the JS? Do I right the code in the <head>, <style> or <body>? Do we use the same coding I have been learning in the Khan Academy Intro to JS: Drawing & Animating? (https://www.khanacademy.org/computing/computer-programming/programming)",
  "258": "Let's say I write an HTML code in office open and save it as HTML.how do I upload it to make it a webpage?",
  "259": "how do I make my webpage upload songs, videos and images?",
  "260": "how do you get oh noes the avatar i have watch all computer programing videos.",
  "261": "Is making websites easy",
  "262": "Which section will help me write HTML?",
  "263": "Are you a potato?",
  "264": "What's the difference between a server and a client?",
  "265": "How was the web invented?",
  "266": "Hi how can you make a website and post it on the internet",
  "267": "I have been searching for a while and I really want to learn JS for making a robot is this the place for me?",
  "268": "How could I make my own browser? I want to know. Thanks!",
  "269": "There are many different browsers such as Google. But Google uses Python, so why is that?",
  "270": "Do you like Star Wars? Well, this is by hodgestrevor2024, and it's about Episode 9! Check it out:\nhttps://www.khanacademy.org/computer-programming/star-wars-episode-9/5531490714681344\nHope you enjoy it!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n(I'm doing this because hodgestrevor2024 is under 13)",
  "271": "This is hard can I have some help",
  "272": "Are the web pages that we make here on KA able to be seen my every internet user, or just those on KA?",
  "273": "I made a website, How can I give it a domain?",
  "274": "how can i use javascript in html?",
  "275": "what do servers connect to?",
  "276": "is css out dated?",
  "277": "Where do you go to see other people's web pages? Does khan offer web hosting?",
  "278": "why do we have to do this?",
  "279": "How does the browser interpret our HTML code. Is the execution done line by line sequentially ?",
  "280": "How is it that when you type certain things it  shows up on the other side of the screen?",
  "281": "Can I ask how old you have to be to have your own webpage? :) Thanks!",
  "282": "Browsers, I have always understood to be the client that you use to access the web.  I've always heard the term 'client' used to describe the particular software that you install to access a specific type of server protocol.   Such as Firefox for the web or MIRC for IRC or Filezilla for FTP etc...The speaker is talking about the term 'client' as though it's the hardware (2:20).  Does the speaker have her own definition for the term 'client' or how common is it to be used in this way.  \n Sometimes the meaning of terms change over time so perhaps, nowadays with all the different hardware choices one has to access the internet 'client' has come to mean device?",
  "283": "I'm 10, and I want to learn to code/hack(white hat, of course~). What's the easiest way to learn?",
  "284": "I've watches this video 3 times, and it still hasn't said I've completed it.....is there a way to fix it?",
  "285": "In am in 10 standard , I want to start learning html by khan academy \nIt is good for me or not tell me",
  "286": "hello, i am a student from Hong Kong.i study CSS and HTML when i was primary school,now my age is 14,i want to do a webside,but before i use this software call dreamweaver,was is good or worst to let tiro to make a webside?",
  "287": "Is it possible to run Khan Academy's JS code in a webpage? If yes, then how?",
  "288": "What does Html stand for?\nHyper\nText\nM-?\nL-?",
  "289": "Just a question, but are these \"Hour of Code\" things, videos only available this week or are they always on?",
  "290": "How hard is this",
  "291": "how do you make a website",
  "292": "If I want to create my own personal website how would I do that?",
  "293": "how come making a website is so complicated? Is it so the scientists who DO know seem smarter than everyone else?",
  "294": "Interesting video but i don't really understand JavaScript",
  "295": "How does CSS help in making websites?",
  "296": "How ti make a website ¿",
  "297": "i does not understand the meaning of server",
  "298": "when we use web,how they have lots of information(how they collect it)?",
  "299": "I am a kid wanting to learn Computer Science.  I am just curious, what is the easiest language?  What is the most useful?  And also, do I have to memorize every single command?",
  "300": "If you get a chemistry question how can you differentiate whether they want you to find the atomic mass or the atomic weight?",
  "301": "At 4:19, what are the reasons why people see carbon-12 as the benchmark instead of hydrogen-1 ?",
  "302": "why does the atomic weight differ from one periodic table to another?",
  "303": "Can someone explain the amu to me please?  What does it mean and how is it used to find other values such as molar mass and the mass of a molecule?",
  "304": "Is Carbon-14 radioactive? If yes, then how?",
  "305": "At 5:04 he says the atomic weight is not the mass of one atom but a weighted average. I don't quite get the following explanation he gives in the video. Does he mean the Atomic weight is an average weight of all the atoms in the world?",
  "306": "You mentioned that, atomic mass and atomic weight almost have same meaning...so why do we use both of these terms in chemistry? Why not just one term? is it just because that we need to highlight the fact that whether the element present has been found on earth or under influence of any other gravitational pull?\nBecause according to my level of understanding, both, atomic mass n atomic weight have been measured as averages .Sorry, if I'm wrong anywhere !",
  "307": "Is there a difference in the mass of a proton and a neutron?",
  "308": "What's the difference between an ion and an unstable atom?",
  "309": "How is mass determined?",
  "310": "Also, if an atom has less neutrons than protons (other than hydrogen), wouldn't the protons repel each other since there aren't enough neutrons?",
  "311": "When I measure something on scales, it tells me the object's \"weight\" in kilograms . If weight is not measured in kilograms, does that mean that the scales are actually calculating the mass of the object?",
  "312": "Would the atomic weight of all isotopes of elements be different on different planets?",
  "313": "What exactly is an isotope? Sal keeps mentioning the word \"isotope\". He explained it a little, but I still don't quite understand.",
  "314": "May someone please explain what atomic weight is? I'm extremely confused.",
  "315": "Is the atomic mass the same as the relative atomic mass?",
  "316": "at around 3:30 he calls carbon-12 an isotope, but i thought that isotopes were defined as atoms that have more neutrons than protons in their nucleus. carbon-12 has 6 protons and 6 neutrons in the nucleus, why is it an isotope?",
  "317": "I did not understand what atomic weight , Sal said it is the average of all isotopes of a certain element then for carbon it should be :  (12+13+14)  / 3  then it is 29. .........  or is it about the average of the amount of isotopes present on Earth ?",
  "318": "AMU is the  mass of 1 atom,neutron or  proton?\nwhat is the difference between Atomic mass and Atomic weight?\nwhat of is the defination of AM and Aw?",
  "319": "At about 4:13 you explained a little about why Hydrogen was not used for the benchmark.  Can you expand on the reason why it is carbon-12 and not Hydrogen?",
  "320": "Carbon has 6 protons, but oxygen has 8. The characteristics and properties of carbon and oxygen are different too. So how come when carbon gets two more protons, it's characteristics and properties change? Or is there some other reason?",
  "321": "What is the atomic weight? I still don't get it.",
  "322": "Is the atomic mass of carbon-13 is 13?",
  "323": "How do scientists find out the ratio of carbon-12 to carbon-14 atoms",
  "324": "if you think of amu of carbon 12 it has exactly a mass of 12          \n  same way in a carbon 14 it also hame mass of 14\n                                                                           then how is the mass of a carbon atom is 12.011",
  "325": "What is the definition of inertia?",
  "326": "what is an isotope?",
  "327": "What's the relationship between Atomic Mass(Ar) and Mass Number(A)? For example, the Atomic Mass and Mass Number of Helium are both 4. Why are they equal?",
  "328": "After reading some of the comments, I learnt that atomic weight is now referred to as standard relative atomic mass, RAM. So does that mean RAM can be defined as the weighted average of the abundance of all the isotopes of an element? And how does this definition relate to its other definition; \"the ratio of the mass of an atom to 1/12 the mass of one atom of carbon-12\" ? \nAnd at 5.02, atomic weight is still a mass. Does that mean the unit for RAM is amu as well?\nSorry for the long question, I'm just very confused at the moment.",
  "329": "Can any atoms have 0 neutrons?",
  "330": "why is hydrogen not used to define amu nowadays??",
  "331": "what if we are dealing with a carbon-14 atom ... ? should we have to change the definition of amu then... ?\nand why they used the definition for amu in terms of carbon-12 isotope ... ?",
  "332": "How do they determine the abundance of different isotopes to find the overall atomic weight for the element? For example, there is Carbon-12 and Carbon-14, there are much more Carbon -12 than Carbon -14 which gives it an atomic weight of 12.011, but is there an experiment to find how much of each isotope exist in the world?",
  "333": "If weight and mass are so different then why do we obtain both of their measurements by using a scale? And if we obtain both mass and weight using a scale, how would would we measure our mass on the moon so that it is the same as it is on Earth?",
  "334": "why carbon-12 ?\n'cause the mass of carbon_12 comes from 6n + 6p+ = 12 u (or amu).\nI mean that is true for any element.",
  "335": "Is the atomic weight the average of all the sorts of that specific atom naturally occuring on earth (like with carbon: carbon 12, carbon 13 and carbon 14. So (carbon 12 + carbon 13 + carbon 14) divided by 3, or the average of all the atoms on earth from that atom (so all the carbon 12 atoms and all the carbon 13 atoms and all the carbon 14 atoms on earth divided by 3)? Or  mabey something else?",
  "336": "what is the reason behind these isotopes? I mean why is there variation between the number of neutrons in the atoms",
  "337": "Do carbon -12 have more neutrons than carbon-14?",
  "338": "at 6:28 you explained that carbon 12 has 6/ neutrons and protons each. so doesnt it make a balanced atom but you are saying its an isotope??",
  "339": "what does STP stand for?",
  "340": "how did the chemists figure out that carbon 12's atomic mass is 12 ?",
  "341": "How is inertia related with mass?",
  "342": "can two different elements have the same mass if they are isotopes",
  "343": "I don't understand how these scientists can weigh ATOMS. How can you weigh something you cannot see?",
  "344": "Can we see Atoms using microscopes of any sort ?",
  "345": "Say one of my fingers got cut off would my mass change then?",
  "346": "Does a scale measure your weight or mass? 2:13",
  "347": "why does the atomic mass of hydrogen different?",
  "348": "How many of a magnesium atom's 12 electrons are valence electrons",
  "349": "Why didn't he show the Carbon -12 and carbon- 13 , Which are common in the world?",
  "350": "So from what I am getting from this is that atomic weight is the average of all the carbon atoms and their isotopes in an defined volume.... because in a bunch of carbon isotopes could've naturally formed and it is not pure carbon, but a mix of isotopes and regular carbon? Is this correct?",
  "351": "In the video,you talked about carbon-12 and 14.Then,what is the atomic mass of Diamond since it is also a form of carbon?",
  "352": "Why do you have to consider the isotopes of the element to find out the relative atomic mass?",
  "353": "Don't newtons measure force?",
  "354": "At 7:50, Sal says that the atomic weight of an element is the average mass of all the atoms of that element on Earth. However, how did we calculate the amount of each isotope were on this planet, if so much of it is undiscovered? If he meant something different, what is it? \nThanks!",
  "355": "what is inertia",
  "356": "what about the electron?",
  "357": "does every element have an isotope ?",
  "358": "How scientists calculated the mass of carbon -12 isotope which is exactly equal to 12 amu?",
  "359": "What's the symbol Sal draws next to 1 proton and 1 neutron at 7:00?",
  "360": "How can chemists get the average atomic mass?Where did they get the information?",
  "361": "I thought in the periodic table the atomic weight(AMU)is 12.011, which is closer to 12, but how do they get carbon-14? I thought it was carbon-12 only.",
  "362": "At 4:20, the video talked about how carbon-12 is the benchmark for atomic mass units. Is there a reason why they chose carbon over another isotope? For example, if they took carbon-14, and divided the total mass by 14, would that still be around an amu? Also, I'm trying to figure out the difference between mass number and atomic mass. Is atomic mass the more specific mass of all the protons and electrons in an atom, while mass number is rounded to integers in atomic mass units?",
  "363": "I was just wondering how mass is measured?",
  "364": "In the periodic table, The molecular mass is given right? Is that the molecular mass or the relative alomic mass?",
  "365": "I didn't fully understand the concept of carbon 12. Can someone please explain?",
  "366": "If one amu is one twelfth of a Carbon-12 atom, and a C-12 atom has 6 Protons, and 6 Neutrons, then I would expect one amu to be an average between the mass of one Neutron and one Proton. That is, wouldn't it fall somewhere between the masses of the two different particles, with one particle being larger than an amu, and one being smaller?\nBut a previous question was answered, stating that both the Proton and the Neutron have a mass slightly larger than an amu, (i.e. 1.0073 amu for a proton). Does the Carbon atom have slightly larger than average neutrons? Has the definition been modified since it was defined as 1/12 the mass of a Carbon-12 atom? Or is the extra mass in the C-12 atom accounted for by something else? Thanks.",
  "367": "I still don't understand the difference between atomic weight and atomic mass. Like, are they the same thing? I'm still not sure",
  "368": "I live in the U.S. is weight still measured in Newtons here?",
  "369": "You hinted that the mass of carbon-12 is also affected by the mass of electrons (and some other things), but it wasn't entirely clear:  isn't it important that 1 amu is equal to the mass of 1 neutral atom of carbon-12?  Seems like that is one of the big points here in needing to use a specific version of a specific element to define the unit - or am I missing something?",
  "370": "So if you get a question saying how much you are on the moon what would you write?",
  "371": "Sal uses the term isotope in the video. What does the term isotope mean?",
  "372": "what is the difference between mass and weight",
  "373": "He states that carbon-12 is an isotope but its atomic no. is 6 and it has 6 neutrons. Can someone explain (sorry I'm still in year 7)?",
  "374": "What is inertia,  what is the definition?",
  "375": "Why is carbon-12 so important here?",
  "376": "So let me confirm this, mass is the amount of matter there is on an object, no matter what planet you're on. Weight is the amount of gravity pulling down the object(9.8m/s^(2)).",
  "377": "What is an isotope?",
  "378": "So basically, atomic weight is the average of atomic mass(es)?",
  "379": "I am having a hard time understanding this, \nAt 5:36 what does Carbon 12 and carbon 14 have to do with atomic weight?",
  "380": "can i know why the protons  are attached to each other  in the nucleus,as  its said that protons have a positive  charge and the like forces repel so i think that they will scatter but nothing takes place,  can i know the why does it happen",
  "381": "Is the normal neutron level of atom 'x' considered an isotope of that atom?",
  "382": "why is it called atomic weight? should'nt it be called average atomic mass??",
  "383": "If I say that my weight is 70 kg, I am not actually talking about my weight, I'm talking about my mass, if I understood Sal correctly. If I use pounds now to give my weight, I am still talking about mass, just in different units right?",
  "384": "so Atomic Weight and Atomic Mass are the same thing in Chemistry?",
  "385": "why isn't atomic weight measured in newtons?",
  "386": "What is an isotope?",
  "387": "I would like to ask what is/are the methods and instruments used in determining the number of Neutrons?",
  "388": "What is the difference between atomic mass and mass number?",
  "389": "At 3:35 Sal references carbon-12 as being an isotope.  Why is carbon-12 considered an isotope?  The number of protons matches the number of neutrons in the nucleus.",
  "390": "Why will Hydrogen always have 1 proton, Helium have 2, and Lithium have 3?",
  "391": "So Carbon-12, the number 12 next to any element name will be the mass number?",
  "392": "Can atoms exist in an unbalanced nature i.e with more or less electrons than protons",
  "393": "In a Weight Machine, we find the unit in Kg.But why?  I think it should be in newton, shouldnt it?",
  "394": "Amu is currently not been used instead unified mass is used in the present world ??\nwhats unified mass ?\nwhats the main difference between atomic mass unit and unified mass ?\n\n\nplease answer my question ?",
  "395": "As Carbon-12 has 6 protons and 6 neutrons and the mass of 1 proton ~ mass of 1 neutron , can we say that 1 amu is just the mass of 1 proton or neutron ?",
  "396": "7:13 - 7:20 | Is there not also some Carbon-13 and Carbon-11?",
  "397": "At 5:20, when Sal is calculating the atomic weight of carbon, he only uses Carbon-12 and Carbon-14. Why doesn't he include Carbon-13, even though there's a lot more of that than Carbon-14?\n\nEdit: This isn't the first time. Sal (and a lot of chemistry books/websites) completely ignore Carbon-13. Why?",
  "398": "how can carbon - 12 be an isotope it's just in it's normal state or stable state ?",
  "399": "why is carbon 14 so rare?",
  "400": "What do you do when there's half of an object?",
  "401": "How does \"●\" symbolise multiplication?",
  "402": "Could you put TWO different symbols to measure more sharper?\nSuch as a banana is 4, and an apple is 5.",
  "403": "What could you do if maybe like if there is 6 blood drops and then there is only a have of a blood drop?",
  "404": "We know that each blood drop represents 8 people. But can that blood drop also represent negative people (ex -> 1 blood drop = -5 people) ?? If so, then how will we solve them?",
  "405": "Isn't a pictograph just a bar chart with pictures?",
  "406": "Why do we divide by 2 when there is half an object ?",
  "407": "how do i read pictographs",
  "408": "Not trying to be mean, but how could this really help in life? Because my math teacher told me that pictographs really help, but HOW!\nThanks everyone! (Especially YOU)",
  "409": "How does \"●\" symbolise multiplication?What do you do when there's half of an object?",
  "410": "what if its 3500 out of 32342 simplified",
  "411": "Where would pictographs be used in real life?",
  "412": "I know this is not that related to the video but shouldn't there be more o neg because o o neg  the common blood type sorry if I have bad grammar I am a fifth grader and I really doubt that no one an will look back at this thing because it is old and I am older do that doesn't matter",
  "413": "what to do if a question said one drip = 3 people but there is half a drip",
  "414": "Does a Pictograph show frequency?",
  "415": "How are pictographs used in real life?",
  "416": "Is there a practical use for pictographs? Why were they invented? Aren't normal graphs easier to work with?",
  "417": "Who created pictographs?",
  "418": "What do you do when there is less than half an object like 1/4 or 1/8 of an object.",
  "419": "What occupations use this graph and in what occasion would a pictograph be useful?",
  "420": "what does \"scale\" mean ? Does it represent 8 people each drop or the total amount of respondents?",
  "421": "what is the place where it says one drop of blood =8 people",
  "422": "what do you do when there's half an object?",
  "423": "what do you when it is a quarter and negitive?",
  "424": "what if its a number like 3 or 5 ?",
  "425": "are the pictures always worth more than 1?",
  "426": "How are there so many blood drops.",
  "427": "at 0:12 what is o-blood",
  "428": "[not really related] Am I the only one that giggled internally when he said Type O Negative?",
  "429": "What blood type do you have , A + or-  , B + or-, AB + or- ,OR O+ or-?",
  "430": "this is super hard and im a six grader",
  "431": "why do we need to know this i or any of you will need to ever know this",
  "432": "What if  7/10 of the picture is shown and in case they ask us how much it is  What can we do in such problems? for example if more than half a circle is shown and they'd say that each is 6 somethings then?",
  "433": "How many blood types are there?",
  "434": "why blood drops? why not rain drops?",
  "435": "Is this the only type of pictograph or are there other types.",
  "436": "why did you do blood",
  "437": "what do you do if its a quarter of an object",
  "438": "Sooooo, ● is also a multiplication sign?\n\n12●5= 60.",
  "439": "What are the - and + on the blood types?",
  "440": "why did Sam put a dot instead of a X or a multiplication symbol",
  "441": "why is it called a pictograph",
  "442": "I  don't know if the question has already been asked but what if the object is halved?please can you explain clearly?",
  "443": "What does '.' Mean 'cause a period in the middle of the scentence would look funny.",
  "444": "the guy in the video talks about o+ and o- blood.what is that??",
  "445": "how does / equal a division problem",
  "446": "what do you do  when there's half of an object",
  "447": "At 0:29, could the scale also be called a key?",
  "448": "what do you do when there is 2 in one thing",
  "449": "Am I the only one that finds this easy?",
  "450": "is there such thing as a quartrer of a blood drop\njust curious",
  "451": "I still dont uderstand what Pictographs are could someone explain?",
  "452": "This is so easy I mastered  it when I  first had khan a....... question is  do sometimes it confused you when you count wrong ?? : '' )",
  "453": "What happens when there is half of an object? How do I multiply that?",
  "454": "I don't understand can someone help me",
  "455": "What do you do when there's half of an object.",
  "456": "what is the differance between this picto graph and a regular graph",
  "457": "Where would pictographs be used in real life?",
  "458": "how in the world do you get this video to play?",
  "459": "Are pictographs kinda like histograms?",
  "460": "What is A B AB O bloods?",
  "461": "this is too easy......... what I meant to say was it's easy for me but it may not be for other people so I apologize if anyone took offense or anything like that.",
  "462": "A copy machine makes 28 copies per minute. How long does it take to make 119 copies?",
  "463": "can there be half numbers",
  "464": "10:50 what are pictograms?",
  "465": "Do you know if it would be cheating to bring a chart of multiplication when I am doing \"reading pictographs 2\" ?",
  "466": "kinda off...topic but is O-good or bad and is O+good",
  "467": "Why is everyone so consernd about the blood drops ??? its just BLOOD !!!",
  "468": "At 0:38 i dont get it, so for A+, seven people have only one blood drop?",
  "469": "what do you do when there is a quarter object?",
  "470": "Do you have to multiply by how many numbers there are in the set? Can it also be a negative number?",
  "471": "they will say if it is a half or not.",
  "472": "will i answer questions for this video?",
  "473": "Did u know x is the most common variable wow great job X",
  "474": "What are the applications of using a pictograph versus a Bar graph or chart graph?",
  "475": "omg becky I toatly get it",
  "476": "how do I figure out the mode",
  "477": "i agree with Celia what do the halves mean in the problem ?",
  "478": "i am not that good with this but it good i would like some tips please                                                                                                       thank you",
  "479": "what do u do if there is and 1/4 of and object",
  "480": "why do sharks have many teeth.\nand why do they have sharp teeth.",
  "481": "How do you make a stem and leaf plot",
  "482": "how many is it 16",
  "483": "I swear they're called pictograms... Aren't they??",
  "484": "does it work with decimals",
  "485": "At 0:43, what does he explain ?",
  "486": "so it doesn't matter what number the pic shows if one of the drops are cut in half the number will cut in half?",
  "487": "Where Would You Use This?",
  "488": "what do you with the extra",
  "489": "what i dont get it re explain please some body\r\n",
  "490": "Is it possible to have a hundreth of a (drop) unit in a pictograph?",
  "491": "How Many Is 1+1+2=4?",
  "492": "does the blood drops stand for how much people dead",
  "493": "Why is the world are you using blood for an example?!",
  "494": "Is this video broken?\r\n",
  "495": "how is the sun very, very, very, hot.",
  "496": "- + what do that mean",
  "497": "What if you needed to draw a pictograph but didn't have all the information? How would you find the information to draw the pictograph? And btw I'm only ten and can spell GREATLY. Cause meh is AWESOME! CX",
  "498": "is there reading  compriencion",
  "499": "Will you be my friend?"
}